import java.util.Random;

public class Ex02_Preload
{
	static int num; //스태틱 멤버 변수
	
	//스태틱 초기화 블록
	static {
		Random rand = new Random(); //#임의의 수를 만드는 기능이 자바에서는 Random클래스에 이미 만들어져있기에 임포트하여 사용.
		//main() 실행 전에 이미 난숫값이 대입이 된다.
		num = rand.nextInt(100); // 0~99 사이의 임의의 숫자를 반환
	}
	
	public static void main(String[] args)
	{
		System.out.println(num); //이렇게 main에서 별다른 값을 변수에 대입하지 않아도 이미 static으로 지정한 영역에서
		//프로그램 실행 전 미리 로드가 되어있기에 임의의 수가 이미 값으로 들어가 있다.

	}
    //이렇게 편리한 스태틱 변수지만, 메모리 사용 효율성이라던지 외부에서 함부로 접근하여 데이터를 수정할 수 없도록 해야한다는
   //객체지향 프로그래밍 원칙에 위배되는 변수이기에 꼭 필요한 경우에만 심사숙고해서 사용하여야 한다.
  //*스태틱 변수는 이렇지만 스태틱 메서드는 유틸리티 성격의 프로그램에서 많이 사용함. 
 //(자주 사용되는 특정 기능이라면 많은 클래스에서 중복되어 만들어지지 않게 하기 위함)
}
